# table of contents

1.Data Structures with Examples
2.Create and Manipulate the DataFrames
3.Sort

### Let's begin with some hands-on practice exercises

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 1. Create a dictionary named 'europe_dict' which has names of countries in europe, their capital and their population. 
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
  <tr>
  <th>Country </th>
  <th>Capital</th>
  <th>Population</th>    
  </tr>
  <tr>
  <td>Spain</td>
  <td>Madrid</td>
  <td>46.77</td>    
  </tr>
  <tr>
  <td>France</td>
  <td>Paris</td>
  <td>66.03</td> 
  </tr>
  <tr>
  <td>Germany</td>
  <td>Berlin</td>
  <td>80.62</td> 
  </tr>
  <tr>
  <td>Norway</td>
  <td>Oslo</td>
  <td>5.084 </td> 
</tr>
</table>

In [5]:
import pandas as pd
import numpy as np
europe_dict = ({'Country':['Spain','France','Germany','Norway'],
                            'Capital':['Madrid','Paris','Berlin','Oslo'],
                           'Population':[46.77,66.03,80.62,5.084]})
print('the required dictionary is:' )
europe_dict

the required dictionary is:

{'Country': ['Spain', 'France', 'Germany', 'Norway'],
 'Capital': ['Madrid', 'Paris', 'Berlin', 'Oslo'],
 'Population': [46.77, 66.03, 80.62, 5.084]}

In [6]:
europe=pd.DataFrame(europe_dict)
europe

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

<table>
  <tr>
  <th>Country </th>
  <th>FamousFor</th>   
  </tr>
  <tr>
  <td>Spain</td>
  <td>Football</td>  
  </tr>
  <tr>
  <td>France</td>
  <td>Eiffel Tower</td>
  </tr>
  <tr>
  <td>Germany</td>
  <td>Cars</td>
  </tr>
  <tr>
  <td>Norway</td>
  <td>Midnight sun</td>
</tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 2. In the data in question 1, add a new column 'FamousFor'. The column tells what each country is famous for.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [7]:
europe['FamourFor']=['Football','Eiffel Tower','Cars','Midnight Sun']
europe

   Country Capital  Population     FamourFor
0    Spain  Madrid      46.770      Football
1   France   Paris      66.030  Eiffel Tower
2  Germany  Berlin      80.620          Cars
3   Norway    Oslo       5.084  Midnight Sun

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 3. Use the data created in question 1, to do the following:
                          <ol type = '1'>
                              <li>  Access column 'Captial' by specifying the column number. </li>
                              <li>  Access column 'Population' by specifying the column name.
                              <li>  Access a country information </li>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [8]:
#1
europe.iloc[:,1]

0    Madrid
1     Paris
2    Berlin
3      Oslo
Name: Capital, dtype: object

In [10]:
#2)
europe['Population']

0    46.770
1    66.030
2    80.620
3     5.084
Name: Population, dtype: float64

In [12]:
# 3. Access a country information

europe.iloc[:,0]

0      Spain
1     France
2    Germany
3     Norway
Name: Country, dtype: object

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 4. Read a csv file "products.csv", print it and also check its dimensions
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [4]:
# read the file

data = pd.read_csv("products.csv")

data

  Product ID  Cost Price  Selling Price
0       45SD          60            135
1       12PO          43            121
2       54PL          78            150
3       26PL          65            121
4       68HG          50            132
5       21ER         150            152
6       10FG         132            165
7       57HB         134            161
8       75VB         109            124
9      32HJH         121            152

In [24]:
# check dimension/shape of the dataframe

df.shape

(144, 3)

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 5. Create a new column Profit, calculate the profit using selling price and the cost price.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [5]:
data['Profit']=data['Selling Price']-data['Cost Price']
data.head()

  Product ID  Cost Price  Selling Price  Profit
0       45SD          60            135      75
1       12PO          43            121      78
2       54PL          78            150      72
3       26PL          65            121      56
4       68HG          50            132      82

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [13]:
dat = pd.Series(data=(4,7,-5,3,np.nan),index=['d','b','a','c','e'])
dat

d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 7. Using the series in question 6, find:
                        <ol type = '1'>
                            <li> the minimum of all values </li>
                            <li> the maximum of all value </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [6]:
# the minimum of all values

dat.min()

-5.0

In [14]:
np.min(dat)

-5.0

In [16]:
min(dat)

-5.0

In [7]:
# the maximum of all value

dat.max()

7.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 8. Using the series in question 6, sort:
                         <ol type = '1'>
                             <li>  the values in ascending order </li>
                             <li>  the values in decending order  </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [8]:
# sorting the values in ascending order

dat.sort_values()

a   -5.0
c    3.0
d    4.0
b    7.0
e    NaN
dtype: float64

In [9]:
# sorting the values in decending order

dat.sort_values(ascending=False)

b    7.0
d    4.0
c    3.0
a   -5.0
e    NaN
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 9. Import dataset 'flights' from library seaborn. Print the first 10 rows and last 20 rows of the data set.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [11]:
# import the dataset.
import seaborn as sns
df = sns.load_dataset('flights')

In [12]:
# print the first 10 rows

df.head(10)

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121
5  1949   Jun         135
6  1949   Jul         148
7  1949   Aug         148
8  1949   Sep         136
9  1949   Oct         119

In [13]:
# print the last 20 rows

df.tail(20)

     year month  passengers
124  1959   May         420
125  1959   Jun         472
126  1959   Jul         548
127  1959   Aug         559
128  1959   Sep         463
129  1959   Oct         407
130  1959   Nov         362
131  1959   Dec         405
132  1960   Jan         417
133  1960   Feb         391
134  1960   Mar         419
135  1960   Apr         461
136  1960   May         472
137  1960   Jun         535
138  1960   Jul         622
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 10. Import dataset 'iris' from library seaborn. Check for datatypes of all variable.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [14]:
# load the iris data set as iris

dq = sns.load_dataset('iris')
dq.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [15]:
# check for data types

dq.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

11. Write a program to count the top five commonly used words in a list
Use the below list:

        words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall',
                    'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 
                    'there', 'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

In [17]:
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall',
                    'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 
                    'there', 'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']
from collections import Counter 
word_count=Counter(words_list)
word_count

Counter({'words': 2,
         'will': 6,
         'where': 7,
         'shall': 4,
         'we': 4,
         'there': 2,
         'wow': 1,
         'should': 3,
         'now': 1})

14. Write a program to create a dataframe from the provided lists
Use the following lists to create your arrays:

        columns = ["Science", "Maths", "English"]

        marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]
Hint: Convert the list marks into an array

In [18]:
columns = ["Science", "Maths", "English"]
marks =([[55, 78, 88], [93, 63, 83],[94, 74, 64]])
pd.DataFrame(marks,columns=columns,index=['AMY','RAJ','BOB'])

     Science  Maths  English
AMY       55     78       88
RAJ       93     63       83
BOB       94     74       64

12. Write a program to insert a given column at the second position in a dataframe
Use the dataframe given below:

Name	Age
Emma Larter	34
Mia Junior	59
Sophia Depp	32
James Smith	40
Add the variable 'Salary' as second column

        Salary = [35000, 24000, 55000, 40000]

In [19]:
data={'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],'Age':[34,59,32,40]}
df_student=pd.DataFrame(data=data)
df_student

          Name  Age
0  Emma Larter   34
1   Mia Junior   59
2  Sophia Depp   32
3  James Smith   40

In [20]:
Salary = [35000, 24000, 55000, 40000]
df_student.insert(loc=1, column='Salar',value=[35000, 24000, 55000, 40000])
df_student

          Name  Salar  Age
0  Emma Larter  35000   34
1   Mia Junior  24000   59
2  Sophia Depp  55000   32
3  James Smith  40000   40

Split the 'Name' column into two separate columns as First_Name and Last_Name

In [21]:
df_employee=pd.DataFrame({'Name': ['Emma Larter','Mia Junior','Sophia Depp','James Smith'],'Salary': [3200,4500,3600,5596]})
df_employee

          Name  Salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia Depp    3600
3  James Smith    5596

In [22]:
df_employee[['First_name','Last_name']]=df_employee.Name.str.split(expand=True)
df_employee

          Name  Salary First_name Last_name
0  Emma Larter    3200       Emma    Larter
1   Mia Junior    4500        Mia    Junior
2  Sophia Depp    3600     Sophia      Depp
3  James Smith    5596      James     Smith

 Select the rows from below dataframe where marks are less than 60

In [23]:
df_student=pd.DataFrame({'Name': ['john','robert','jonny','mia'],'Marks': [90,50,89,55]})
df_student

     Name  Marks
0    john     90
1  robert     50
2   jonny     89
3     mia     55

In [24]:
df_student[df_student['Marks']<60]

     Name  Marks
1  robert     50
3     mia     55